espressif/esp-idf/examples/system/ota/partitions_ota/sdkconfig.ci.virt_sb_v2_and_fe_2.esp32c61
CONFIG_IDF_TARGET="esp32c61"

# ESP32-C61 has no RSA based Secure Boot V2 support, so use the ECDSA scheme.
# ECDSA based Secure Boot V2 is not recommended on ESP32-C61 and must be force-enabled.
CONFIG_SECURE_BOOT_INSECURE=y
CONFIG_SECURE_BOOT_V2_FORCE_ENABLE_ECDSA=y
CONFIG_SECURE_SIGNED_APPS_ECDSA_V2_SCHEME=y
CONFIG_SECURE_BOOT_SIGNING_KEY="test/secure_boot_signing_key_ecdsa.pem"
